s_test = "Строка для задания с сайта https://code.mu/ru/python/tasker/stager/1/1/"

#Дана строка. Выведите в консоль длину этой строки.
print(len(s_test))

#Дана строка. Выведите в консоль последний символ строки.
print((s_test[-1]))